Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 32, 1245)]        0         
_________________________________________________________________
dense (Dense)                (None, 32, 16)            19936     
_________________________________________________________________
dense_1 (Dense)              (None, 32, 32)            544       
_________________________________________________________________
dense_2 (Dense)              (None, 32, 3)             99        
=================================================================
Total params: 20,579
Trainable params: 20,579
Non-trainable params: 0
_________________________________________________________________
