Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 40, 421)]         0         
_________________________________________________________________
dense (Dense)                (None, 40, 16)            6752      
_________________________________________________________________
dense_1 (Dense)              (None, 40, 32)            544       
_________________________________________________________________
dense_2 (Dense)              (None, 40, 3)             99        
=================================================================
Total params: 7,395
Trainable params: 7,395
Non-trainable params: 0
_________________________________________________________________
