Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 40, 21229)]       0         
_________________________________________________________________
dense (Dense)                (None, 40, 16)            339680    
_________________________________________________________________
dense_1 (Dense)              (None, 40, 32)            544       
_________________________________________________________________
dense_2 (Dense)              (None, 40, 3)             99        
=================================================================
Total params: 340,323
Trainable params: 340,323
Non-trainable params: 0
_________________________________________________________________
