Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         [(None, 32, 113)]         0         
_________________________________________________________________
dense_3 (Dense)              (None, 32, 16)            1824      
_________________________________________________________________
dense_4 (Dense)              (None, 32, 32)            544       
_________________________________________________________________
dense_5 (Dense)              (None, 32, 3)             99        
=================================================================
Total params: 2,467
Trainable params: 2,467
Non-trainable params: 0
_________________________________________________________________
